AJAXTwitter/app/controllers/follows_controller.rb

INSERT INTO "follows" ("followee_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["followee_id", 8], ["follower_id", 8], ["created_at", "2019-02-13 22:27:00.750224"], ["updated_at", "2019-02-13 22:27:00.750224"]]
---
  def create
    # simulate latency
    sleep(1)

    @follow = current_user.out_follows.create!(followee_id: params[:user_id])

DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 1]]
---
  def destroy
    # simulate latency
    sleep(1)

    @follow = current_user.out_follows.find_by(followee_id: params[:user_id])
    @follow.destroy!